**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [1]:
import pandas as pd
import numpy as np
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df1=df=pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [19]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [20]:
df[0:2]

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [24]:
df[['birds','age']]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [31]:
df.loc[['c','d','h'],["birds","age","visits"]]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [138]:
df[df["visits"]<4]

        birds  age  visits priority
a      Cranes  3.5       2        1
c     plovers  1.5       3        0
e  spoonbills  6.0       3        0
g     plovers  5.5       2        0
h      Cranes  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [13]:
is_NaN=df.isnull()
row=is_NaN.any(axis=1)
row_with_NaN=df[row]
new_df=row_with_NaN
new_df[["birds","visits"]]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [10]:
df1=df.loc[df['birds']=='Cranes']
print(df1.loc[df["age"]<4])

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [17]:
df.loc[(df['age']>=2 ) & (df['age']<=4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [51]:
g=df.groupby("birds")
for data,birds_df in g:
    df_visit=g.sum("visits") 
    print(df_visit.iloc[[0],[1]])
    break

        visits
birds
Cranes      12

**11. Calculate the mean age for each different birds in dataframe.**

In [58]:
g=df.groupby("birds")
for data,birds_df in g:
    new=g.mean('age')
    print(new.iloc[[0,1,2],[0]])
    break

            age
birds
Cranes      3.5
plovers     3.5
spoonbills  6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [13]:
new_data=({'birds':["sparrow"],
                     'age':[13],
                     'visits':[3],
                     'priority':[4]})
df2=pd.DataFrame(new_data,index=['k'])
df2
df3=df1.append(df2)
df3

        birds   age  visits priority
a      Cranes   3.5       2      yes
b      Cranes   4.0       4      yes
c     plovers   1.5       3       no
d  spoonbills   NaN       4      yes
e  spoonbills   6.0       3       no
f      Cranes   3.0       4       no
g     plovers   5.5       2       no
h      Cranes   NaN       2      yes
i  spoonbills   8.0       3       no
j  spoonbills   4.0       2       no
k     sparrow  13.0       3        4

In [14]:
df3.drop('k')

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [16]:
df1['birds'].value_counts()

spoonbills    4
Cranes        4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [104]:
#age sorted in descending order

df.sort_values("age",axis=0,ascending=False,inplace=False,kind='quicksort',na_position='last')

        birds   age  visits  priority
k     sparrow  13.0       3         4
i  spoonbills   8.0       3         0
e  spoonbills   6.0       3         0
g     plovers   5.5       2         0
b      Cranes   4.0       4         1
j  spoonbills   4.0       2         0
a      Cranes   3.5       2         1
f      Cranes   3.0       4         0
c     plovers   1.5       3         0
d  spoonbills   NaN       4         1
h      Cranes   NaN       2         1

In [105]:
# visits sorted in ascending order

df.sort_values("visits",axis=0,ascending=True,inplace=False,kind="quicksort")

        birds   age  visits  priority
g     plovers   5.5       2         0
j  spoonbills   4.0       2         0
a      Cranes   3.5       2         1
h      Cranes   NaN       2         1
k     sparrow  13.0       3         4
i  spoonbills   8.0       3         0
e  spoonbills   6.0       3         0
c     plovers   1.5       3         0
b      Cranes   4.0       4         1
f      Cranes   3.0       4         0
d  spoonbills   NaN       4         1

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [115]:
df["priority"]=df["priority"].replace(['yes','no'],[1,0])
df

        birds  age  visits priority
a      Cranes  3.5       2        1
b      Cranes  4.0       4        1
c     plovers  1.5       3        0
d  spoonbills  NaN       4        1
e  spoonbills  6.0       3        0
f      Cranes  3.0       4        0
g     plovers  5.5       2        0
h      Cranes  NaN       2        1
i  spoonbills  8.0       3        0
j  spoonbills  4.0       2        0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [84]:
df['birds']=df['birds'].replace(['Cranes'],'trumpeters')
df

        birds  age  visits priority
a  trumpeters  3.5       2      yes
b  trumpeters  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f  trumpeters  3.0       4       no
g     plovers  5.5       2       no
h  trumpeters  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no